<!doctype html>
<!--[if lt IE 7]> <html class="no-js lt-ie9 lt-ie8 lt-ie7" lang="fr"> <![endif]-->
<!--[if IE 7]>    <html class="no-js lt-ie9 lt-ie8" lang="fr"> <![endif]-->
<!--[if IE 8]>    <html class="no-js lt-ie9" lang="fr"> <![endif]-->
<!-- Consider adding a manifest.appcache: h5bp.com/d/Offline -->
<!--[if gt IE 8]><!--> <html class="no-js" lang="fr"> <!--<![endif]-->
	<head>
		<meta charset="utf-8">

		<title>CloudBook - A Social Network of Applications</title>
		<meta name="description" content="A Social Network of Applications">

		<!-- Mobile viewport optimized: h5bp.com/viewport -->
		<meta name="viewport" content="width=device-width">
		<link rel="stylesheet" href="style.css">
	</head>
	<body>
		<header>
			<h1>CloudBook</h1>
			<h2>A Social Network of Applications</h2>
			
		</header>
		<div class="main">
			<p>
				Le march&eacute; du cloud computing est en plein essor mais il est difficile de comparer les diff&eacute;rentes offres qui existent et de faire son choix. Ce projet, initi&eacute; par l'&eacute;quipe Myriads de l'IRISA, a pour objectif de faciliter le choix du meilleur cloud pour y ex&eacute;cuter ses applications. Pour ce faire CloudBook constituera un r&eacute;seau d'applications qui r&eacute;cup&eacute;reront et s'&eacute;changeront des informations relatives &agrave; leur utilisation sur les diff&eacute;rents clouds afin de produire un classement des meilleurs clouds pour chaque application. Le r&eacute;seau sera d&eacute;centralis&eacute; ce qui permettra d'assurer sa p&eacute;rennit&eacute;. Chaque application aura des applications "amies", s&eacute;lectionn&eacute;es de mani&egrave;re automatique en fonction de leurs points communs avec l'application et dont les informations seront les plus pertinentes pour trouver le meilleur cloud pour cette application, en effet plus des applications sont proches en terme de caract&eacute;ristiques, plus leurs besoins sont proches.
				</br>
				La mise en &oelig;uvre sera r&eacute;alis&eacute;e par un r&eacute;seau pair-&agrave;-pair de contr&ocirc;leurs d'applications qui communiqueront via un protocole de type gossip. L'application sera r&eacute;alis&eacute;e en java.
			</p>
			<p>
				Le groupe qui travaille sur le projet est constitu&eacute; de cinq &eacute;tudiants de l'INSA de Rennes en 4&egrave;me ann&eacute;e : Abderrahmane AMALOU, Matthieu BERTIN, Sami EL ALAMI TREBKI, Gwendal LE MOULEC et Bruno MATRY. Le projet est supervis&eacute; par Jean-Louis PAZAT l'un des membres de l'&eacute;quipe Myriads et enseignant-chercheur &agrave; l'INSA de Rennes.
			</p>
			
			<div class="keywords">
				<h1>Mots cl&eacute;s</h1>
				<ul>
					<li>cloud</li>
					<li>gossip</li>
					<li>p2p</li>
					<li>r&eacute;seau social</li>
					<li>comparateur</li>
				</ul>
			</div>
			
			<img src="insa.png" alt="INSA" />
		</div>
	</body>
</html>
